app/controllers/events_controller.rb

  def show
	@event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE (start_date)