app/controllers/tickets_controller.rb

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 15]]
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def destroy
	@ticket = Ticket.find(params[:id]).destroy

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
	@ticket = Ticket.find(params[:id])