app/controllers/users_controller.rb

INSERT INTO "users" ("name", "lastname", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "AAA"], ["lastname", "BBB"], ["email", "a@a.cl"], ["password", "ABC"], ["address", "CBA"], ["created_at", "2019-04-10 18:06:33.441442"], ["updated_at", "2019-04-10 18:06:33.441442"]]
---
  def create
	@user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy
	@user =User.find(params[:id])
	@user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "lastname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "lorca"], ["lastname", "BASDSADSADASDSABB"], ["updated_at", "2019-04-11 15:39:36.846603"], ["id", 12]]
UPDATE "users" SET "name" = ?, "lastname" = ?, "email" = ?, "password" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "AAA"], ["lastname", "BBB"], ["email", "a@a.cl"], ["password", "ABC"], ["address", "CBA"], ["updated_at", "2019-04-10 18:21:11.581982"], ["id", 10]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def update
	respond_to do |format|
	    	if User.find(params[:id]).update(user_params)
	    		@user = User.find(params[:id]).update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
	@user = User.find(params[:id])

SELECT  "users".* FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" INNER JOIN "tickets" ON "tickets"."order_id" = "orders"."id" GROUP BY "user_id" ORDER BY "desc" ASC LIMIT ?  [["LIMIT", 1]]
---
  def user_with_most_tickets
	@user = User.joins(:orders => :tickets).group(:user_id).order(:desc).limit(1)